Repository: pepr/progit2-cs
Catalog: omegat/tm/auto/progit-omegat-asciidoc.tmx
Source language: en
Languages: cs

source: "Mark" is the `fast-import` term for an identifier you give to a commit; as you create commits, you give each one a mark that you can use to link to it from other commits.
cs: „Označovač“ (angl. mark) je termín používaný v souvislosti s metodou `fast-import`. Jedná se o identifikátor, který jednoznačně přiřadíte revizi a lze ho použít k odkazování na tuto revizi z revizí ostatních.

source: == Customizing Git
cs: == Individuální přizpůsobení systému Git

source: == Distributed Git
cs: == Distribuovaný charakter systému Git

source: == Getting Started
cs: == Úvod

source: == Git Basics
cs: == Základy práce se systémem Git

source: == Git Branching
cs: == Větve v systému Git

source: == Git Internals
cs: == Git pod pokličkou

source: == Git Tools
cs: == Nástroje systému Git

source: == Git and Other Systems
cs: == Git a ostatní systémy

source: == Git on the Server
cs: == Git na serveru

source: # a comment - this is ignored # no .a files *.a # but do track lib.a, even though you're ignoring .a files above !lib.a # only ignore the root TODO file, not subdir/TODO /TODO # ignore all files in the build/ directory build/ # ignore doc/notes.txt, but not doc/server/arch.txt doc/*.txt # ignore all .txt files in the doc/ directory doc/**/*.txt
cs: # komentář – ignoruje se # žádné soubory s příponou .a *.a # ale sleduj soubor lib.a, přestože máš ignorovat soubory s příponou .a !lib.a # ignoruj soubor TODO pouze v kořenovém adresáři, ne v podadresářích /TODO # ignoruj všechny soubory v adresáři build/ build/ # ignoruj doc/notes.txt, ale nikoli doc/server/arch.txt doc/*.txt # ignoruj všechny .txt soubory v adresáři doc/ doc/**/*.txt

source: # on your local computer $ git clone git@gitserver:gitosis-admin.git
cs: # na vašem lokálním počítači $ git clone git@gitserver:gitosis-admin.git

source: === A Short History of Git
cs: === Stručná historie systému Git

source: === About Version Control
cs: === Správa verzí

source: === An Example Git-Enforced Policy
cs: === Příklad vynucení chování systémem Git

source: === Basic Branching and Merging
cs: === Základy větvení a slučování

source: === Branch Management
cs: === Správa větví

source: === Branching Workflows
cs: === Možnosti při práci s větvemi

source: === Contributing to a Project
cs: === Přispívání do projektu

source: === Debugging with Git
cs: === Ladění v systému Git

source: === Distributed Workflows
cs: === Distribuované pracovní postupy

source: === First-Time Git Setup
cs: === První nastavení systému Git

source: === Generating Your SSH Public Key
cs: === Vygenerování veřejného SSH klíče

source: === Getting Git on a Server
cs: === Jak umístit Git na server

source: === Getting Help
cs: === Získání nápovědy

source: === Getting a Git Repository
cs: === Získání repozitáře Git

source: === Git Attributes
cs: === Atributy Git

source: === Git Basics
cs: === Základy systému Git

source: === Git Configuration
cs: === Konfigurace systému Git

source: === Git Daemon
cs: === Démon Git

source: === Git Hooks
cs: === Zásuvné moduly Git

source: === Git Objects
cs: === Objekty Git

source: === Git References
cs: === Reference Git

source: === Git and Subversion
cs: === Git a Subversion

source: === Hosted Git
cs: === Hostování projektů Git

source: === Installing Git
cs: === Instalace systému Git

source: === Interactive Staging
cs: === Interaktivní příprava k zapsání

source: === Maintaining a Project
cs: === Správa projektu

source: === Maintenance and Data Recovery
cs: === Správa a obnova dat

source: === Migrating to Git
cs: === Přechod na systém Git

source: === Packfiles
cs: === Balíčkové soubory

source: === Plumbing and Porcelain
cs: === Nízkoúrovňové a vysokoúrovňové příkazy

source: === Public Access
cs: === Veřejný přístup

source: === Rebasing
cs: === Přeskládání

source: === Recording Changes to the Repository
cs: === Nahrávání změn do repozitáře

source: === Remote Branches
cs: === Vzdálené větve

source: === Revision Selection
cs: === Výběr revize

source: === Rewriting History
cs: === Přepis historie

source: === Setting Up the Server
cs: === Nastavení serveru

source: === Stashing
cs: === Odložení

source: === Submodules
cs: === Submoduly

source: === Subtree Merging
cs: === Začlenění podstromu

source: === Summary
cs: === Shrnutí

source: === Tagging
cs: === Značky

source: === The Protocols
cs: === Protokoly

source: === The Refspec
cs: === Refspec

source: === Tips and Tricks
cs: === Tipy a triky

source: === Transfer Protocols
cs: === Přenosové protokoly

source: === Undoing Things
cs: === Rušení změn

source: === Viewing the Commit History
cs: === Zobrazení historie revizí

source: === What a Branch Is
cs: === Co je to větev

source: === Working with Remotes
cs: === Práce se vzdálenými repozitáři

source: ==== "Wildcard" repositories
cs: ==== „Wildcard“ repozitáře

source: ==== A Custom Importer
cs: ==== Vlastní importér

source: ==== A SHORT NOTE ABOUT SHA-1
cs: ==== Krátká poznámka k hodnotě SHA-1

source: ==== Adding Collaborators
cs: ==== Přidávání spolupracovníků

source: ==== Adding Remote Repositories
cs: ==== Přidávání vzdálených repozitářů

source: ==== Advanced Access Control with "deny" rules
cs: ==== Rozšířené řízení přístupu pravidly typu „odmítnutí“

source: ==== Ancestry References
cs: ==== Reference podle původu

source: ==== Annotated Tags
cs: ==== Anotované značky

source: ==== Applying Patches from E-mail
cs: ==== Aplikace záplat z e-mailu

source: ==== Auto-Completion
cs: ==== Automatické dokončování

source: ==== Basic Branching
cs: ==== Základní větvení

source: ==== Basic Client Configuration
cs: ==== Základní konfigurace klienta

source: ==== Basic Merge Conflicts
cs: ==== Základní konflikty při slučování

source: ==== Basic Merging
cs: ==== Základní slučování

source: ==== Binary Files
cs: ==== Binární soubory

source: ==== Binary Search
cs: ==== Binární vyhledávání

source: ==== Branch References
cs: ==== Reference větví

source: ==== Centralized Version Control Systems
cs: ==== Centralizované systémy správy verzí

source: ==== Centralized Workflow
cs: ==== Centralizovaný pracovní postup

source: ==== Changing Multiple Commit Messages
cs: ==== Změna několika zpráv k revizím

source: ==== Changing Your Last Commit
cs: ==== Změna poslední revize

source: ==== Changing the Last Commit
cs: ==== Změna poslední revize

source: ==== Checking Out Remote Branches
cs: ==== Checkout vzdálených větví

source: ==== Checking Your Settings
cs: ==== Kontrola vašeho nastavení

source: ==== Checking the Status of Your Files
cs: ==== Kontrola stavu souborů

source: ==== Client-Side Hooks
cs: ==== Zásuvné moduly na straně klienta

source: ==== Cloning a Project with Submodules
cs: ==== Klonování projektu se submoduly

source: ==== Cloning an Existing Repository
cs: ==== Klonování existujícího repozitáře

source: ==== Colors in Git
cs: ==== Barvy systému Git

source: ==== Commit Guidelines
cs: ==== Pravidla pro revize

source: ==== Commit Objects
cs: ==== Objekty revize

source: ==== Commit Ranges
cs: ==== Intervaly revizí

source: ==== Committing Back to Subversion
cs: ==== Zapisování zpět do systému Subversion

source: ==== Committing Your Changes
cs: ==== Zapisování změn

source: ==== Config File and Access Control Rules
cs: ==== Konfigurační soubor a pravidla přístupu

source: ==== Creating Tags
cs: ==== Vytváření značek

source: ==== Creating a Branch from a Stash
cs: ==== Vytvoření větve z odkladu

source: ==== Creating a New Repository
cs: ==== Vytvoření nového repozitáře

source: ==== Customising the Install
cs: ==== Přizpůsobení instalace

source: ==== Data Recovery
cs: ==== Obnova dat

source: ==== Deleting References
cs: ==== Mazání referencí

source: ==== Deleting Remote Branches
cs: ==== Mazání vzdálených větví

source: ==== Determining What Is Introduced
cs: ==== Jak zjistit provedené změny

source: ==== Dictator and Lieutenants Workflow
cs: ==== Pracovní postup s diktátorem a poručíky

source: ==== Distributed Version Control Systems
cs: ==== Distribuované systémy správy verzí

source: ==== Exporting Your Repository
cs: ==== Export repozitáře

source: ==== External Merge and Diff Tools
cs: ==== Externí nástroje pro diff a slučování

source: ==== Fetching and Pulling from Your Remotes
cs: ==== Vyzvedávání a stahování ze vzdálených repozitářů

source: ==== File Annotation
cs: ==== Anotace souboru

source: ==== Forking Projects
cs: ==== Štěpení projektů

source: ==== Formatting and Whitespace
cs: ==== Formátování a prázdné znaky

source: ==== Generating a Build Number
cs: ==== Vygenerování čísla sestavení

source: ==== Getting Started
cs: ==== První kroky

source: ==== Git Aliases
cs: ==== Aliasy Git

source: ==== Git Branching Issues
cs: ==== Problémy s větvemi systému Git

source: ==== Git Generally Only Adds Data
cs: ==== Git většinou jen přidává data

source: ==== Git Has Integrity
cs: ==== Git pracuje důsledně

source: ==== Git-Svn Summary
cs: ==== Git-Svn: shrnutí

source: ==== GitHub Summary
cs: ==== Shrnutí k serveru GitHub

source: ==== Ignoring Files
cs: ==== Ignorované soubory

source: ==== Importing
cs: ==== Import

source: ==== Importing from Subversion
cs: ==== Import ze systému Subversion

source: ==== Initializing a Repository in an Existing Directory
cs: ==== Inicializace repozitáře v existujícím adresáři

source: ==== Inspecting a Remote
cs: ==== Prohlížení vzdálených repozitářů

source: ==== Installing
cs: ==== Instalace

source: ==== Installing a Hook
cs: ==== Instalace zásuvného modulu

source: ==== Installing from Source
cs: ==== Instalace ze zdrojových souborů

source: ==== Installing on Linux
cs: ==== Instalace v Linuxu

source: ==== Installing on Mac
cs: ==== Instalace v systému Mac

source: ==== Installing on Windows
cs: ==== Instalace v systému Windows

source: ==== Integrating Contributed Work
cs: ==== Integrace příspěvků

source: ==== Integration-Manager Workflow
cs: ==== Pracovní postup s integračním manažerem

source: ==== Issues with Submodules
cs: ==== Problémy se submoduly

source: ==== Keyword Expansion
cs: ==== Rozšíření klíčového slova

source: ==== Lightweight Tags
cs: ==== Prosté značky

source: ==== Limiting Log Output
cs: ==== Omezení výstupu logu

source: ==== Limiting Log Output according to Date/Time
cs: ==== Omezení výstupního logu na určité datum nebo čas

source: ==== Listing Your Tags
cs: ==== Výpis značek

source: ==== Local Protocol
cs: ==== Lokální protokol

source: ==== Local Version Control Systems
cs: ==== Lokální systémy správy verzí

source: ==== Long-Running Branches
cs: ==== Dlouhé větve

source: ==== Maintenance
cs: ==== Správa

source: ==== Merge Strategies
cs: ==== Strategie slučování

source: ==== More Interesting Rebases
cs: ==== Zajímavější možnosti přeskládání

source: ==== Moving Files
cs: ==== Přesouvání souborů

source: ==== Nearly Every Operation Is Local
cs: ==== Téměř každá operace je lokální

source: ==== Object Storage
cs: ==== Ukládání objektů

source: ==== Other Features
cs: ==== Další vlastnosti

source: ==== Personal Branches
cs: ==== Osobní větve

source: ==== Preparing a Release
cs: ==== Příprava vydání

source: ==== Private Managed Team
cs: ==== Soukromý řízený tým

source: ==== Private Small Team
cs: ==== Malý soukromý tým

source: ==== Public Large Project
cs: ==== Velký veřejný projekt

source: ==== Public Small Project
cs: ==== Malý veřejný projekt

source: ==== Pulling in New Changes
cs: ==== Stažení nových změn

source: ==== Pushing
cs: ==== Odesílání

source: ==== Pushing Refspecs
cs: ==== Odesílání vzorců refspec

source: ==== Pushing to Your Remotes
cs: ==== Odesílání do vzdálených repozitářů

source: ==== Putting the Bare Repository on a Server
cs: ==== Umístění holého repozitáře na server

source: ==== RefLog Shortnames
cs: ==== Zkrácené názvy v záznamu RefLog

source: ==== Remotes
cs: ==== Reference na vzdálené repozitáře

source: ==== Removing Files
cs: ==== Odstraňování souborů

source: ==== Removing Objects
cs: ==== Odstraňování objektů

source: ==== Removing and Renaming Remotes
cs: ==== Odstraňování a přejmenovávání vzdálených repozitářů

source: ==== Reordering Commits
cs: ==== Změna pořadí revizí

source: ==== Restricting pushes by files changed
cs: ==== Omezení odesílání změn vázané na soubory

source: ==== Server Configuration
cs: ==== Konfigurace serveru

source: ==== Server-Side Hook
cs: ==== Zásuvný modul na straně serveru

source: ==== Server-Side Hooks
cs: ==== Zásuvné moduly na straně serveru

source: ==== Setting Up
cs: ==== Vytvoření repozitáře

source: ==== Setting Up a User Account
cs: ==== Založení uživatelského účtu

source: ==== Sharing Tags
cs: ==== Sdílení značek

source: ==== Short SHA
cs: ==== Zkrácená hodnota SHA

source: ==== Showing Your Remotes
cs: ==== Zobrazení vzdálených serverů

source: ==== Signed Tags
cs: ==== Podepsané značky

source: ==== Single Revisions
cs: ==== Jednotlivé revize

source: ==== Skipping the Staging Area
cs: ==== Přeskočení oblasti připravených změn

source: ==== Small Setups
cs: ==== Nastavení pro malou skupinu

source: ==== Snapshots, Not Differences
cs: ==== Snímky, nikoli rozdíly

source: ==== Splitting a Commit
cs: ==== Rozdělení revize

source: ==== Squashing Commits
cs: ==== Komprimace revize

source: ==== Staging Modified Files
cs: ==== Příprava změněných souborů k zapsání

source: ==== Staging Patches
cs: ==== Příprava záplat

source: ==== Staging and Unstaging Files
cs: ==== Příprava souborů k zapsání a jejich vracení

source: ==== Starting with Submodules
cs: ==== Začátek práce se submoduly

source: ==== Stashing Your Work
cs: ==== Odložení práce

source: ==== Subversion Branching
cs: ==== Větve v systému Subversion

source: ==== Subversion Commands
cs: ==== Příkazy systému Subversion

source: ==== Summary
cs: ==== Shrnutí

source: ==== Superprojects
cs: ==== Superprojekty

source: ==== Switching Active Branches
cs: ==== Přepínání aktivních větví

source: ==== Tagging Later
cs: ==== Dodatečné označení

source: ==== Tagging Your Releases
cs: ==== Označení vydání značkou

source: ==== Tags
cs: ==== Značky

source: ==== The Basic Rebase
cs: ==== Základní přeskládání

source: ==== The Dumb Protocol
cs: ==== Hloupý protokol

source: ==== The Git Protocol
cs: ==== Protokol Git

source: ==== The HEAD
cs: ==== Soubor HEAD

source: ==== The HTTP/S Protocol
cs: ==== Protokol HTTP/S

source: ==== The Nuclear Option: filter-branch
cs: ==== Pitbul mezi příkazy: filter-branch

source: ==== The Perils of Rebasing
cs: ==== Rizika spojená s přeskládáním

source: ==== The SSH Protocol
cs: ==== Protokol SSH

source: ==== The Shortlog
cs: ==== Příkaz „shortlog“

source: ==== The Smart Protocol
cs: ==== Chytrý protokol

source: ==== The Three States
cs: ==== Tři stavy

source: ==== The Very Fast Nuclear Option: Big Friendly Giant Repo Cleaner (BFG)
cs: ==== Velmi rychlá a nebezpečná zbraň: Big Friendly Giant Repo Cleaner (BFG)

source: ==== Topic Branches
cs: ==== Tematické větve

source: ==== Tracking Branches
cs: ==== Sledující větve

source: ==== Tracking New Files
cs: ==== Sledování nových souborů

source: ==== Tree Objects
cs: ==== Objekty stromu

source: ==== Un-applying a Stash
cs: ==== Odvolání odkladu

source: ==== Unmodifying a Modified File
cs: ==== Rušení změn ve změněných souborech

source: ==== Unstaging a Staged File
cs: ==== Odstranění souboru z oblasti připravených změn

source: ==== Using a GUI to Visualize History
cs: ==== Grafické uživatelské rozhraní pro procházení historie

source: ==== Verifying Tags
cs: ==== Ověřování značek

source: ==== Viewing Your Staged and Unstaged Changes
cs: ==== Zobrazení připravených a nepřipravených změn

source: ==== Working in Topic Branches
cs: ==== Práce v tematických větvích

source: ==== Your Diff Tool
cs: ==== Váš nástroj diff

source: ==== Your Editor
cs: ==== Váš editor

source: ==== Your Identity
cs: ==== Vaše totožnost

source: ==== Your Project
cs: ==== Váš projekt

source: ===== Applying a Patch with am
cs: ===== Aplikace záplaty příkazem „am“

source: ===== Applying a Patch with apply
cs: ===== Aplikace záplaty příkazem „apply“

source: ===== Changing E-Mail Addresses Globally
cs: ===== Globální změna e-mailové adresy

source: ===== Committing-Workflow Hooks
cs: ===== Zásuvné moduly k zapisování revizí

source: ===== Creating a New SVN Branch
cs: ===== Vytvoření nové větve SVN

source: ===== Diffing Binary Files
cs: ===== Nástroj diff pro binární soubory

source: ===== Double Dot
cs: ===== Dvě tečky

source: ===== Downloading Data
cs: ===== Stahování dat

source: ===== E-mail Workflow Hooks
cs: ===== Zásuvné moduly pro práci s e-maily

source: ===== Enforcing Fast-Forward-Only Pushes
cs: ===== Pouze „rychle vpřed“

source: ===== Enforcing a Specific Commit-Message Format
cs: ===== Standardizovaná zpráva k revizi

source: ===== Enforcing a User-Based ACL System
cs: ===== Systém ACL podle uživatelů

source: ===== Identifying Binary Files
cs: ===== Identifikace binárních souborů

source: ===== Ignoring What Subversion Ignores
cs: ===== Ignorování souborů, které ignoruje Subversion

source: ===== Large-Merging Workflows
cs: ===== Pracovní postupy se začleňováním velkého objemu dat

source: ===== Making a Subdirectory the New Root
cs: ===== Povýšení podadresáře na nový kořenový adresář

source: ===== Merging Workflows
cs: ===== Pracovní postupy založené na slučování

source: ===== Multiple Points
cs: ===== Několik bodů

source: ===== Other Client Hooks
cs: ===== Ostatní zásuvné moduly na straně klienta

source: ===== Rebasing and Cherry Picking Workflows
cs: ===== Pracovní postupy s přeskládáním a částečným převzetím

source: ===== Removing a File from Every Commit
cs: ===== Odstranění souboru ze všech revizí

source: ===== SSH Access
cs: ===== SSH přístup

source: ===== SVN Annotation
cs: ===== Anotace SVN

source: ===== SVN Server Information
cs: ===== Informace o serveru SVN

source: ===== SVN Style History
cs: ===== Historie ve stylu SVN

source: ===== The Cons
cs: ===== Nevýhody

source: ===== The Pros
cs: ===== Výhody

source: ===== Triple Dot
cs: ===== Tři tečky

source: ===== Uploading Data
cs: ===== Upload dat

source: ===== pre-receive and post-receive
cs: ===== pre-receive a post-receive

source: ====== Image files
cs: ===== Soubory s obrázky

source: ====== MS Word files
cs: ===== Soubory MS Word

source: $ git fetch [remote-name]
cs: $ git fetch [název vzdáleného repozitáře]

source: $ git help <verb> $ git <verb> --help $ man git-<verb>
cs: $ git help <příkaz> $ git <příkaz> --help $ man git-<příkaz>

source: (For an even more explicit reminder of what you’ve modified, you can pass the `-v` option to `git commit`.
cs: (Chcete-li zařadit ještě podrobnější informace o tom, co jste měnili, můžete k příkazu `git commit` přidat parametr `-v`.

source: (In Git versions 1.6.1 and later, you can also use `git diff --staged`, which may be easier to remember.) This command compares your staged changes to your last commit:
cs: (Ve verzích Git 1.6.1 a novějších můžete použít také příkaz `git diff --staged`, který se možná snáze pamatuje.) Tento příkaz srovná připravené změny (staged changes) s poslední revizí:

source: (I’m replacing the protocol messages with `...` in these examples to shorten them somewhat.)
cs: (V následujících příkladech nahrazuji zprávy protokolů třemi tečkami, abych je trochu zkrátil.)

source: (Note that if you specify both author and grep options, the command will match commits with both.)
cs: (Všimněte si, že pokud použijete současně parametry author a grep, bude příkaz vyhledávat záznamy splňující obojí.)

source: (Obviously this only works on a machine with `grep`, `sort`, and `perl` installed.) Then, redirect that output into your users.txt file so you can add the equivalent Git user data next to each entry.
cs: (Tento příkaz pochopitelně funguje pouze na počítačích, v nichž je nainstalován `grep`, `sort` a `perl`.) Poté tento výstup přesměrujte do souboru users.txt, abyste mohli vedle každého záznamu přidat stejná data o uživatelích Git.

source: (Recap: authentication is identifying who the user is, authorization is deciding if he is allowed to do what he is attempting to).
cs: (Připomeňme si: autentizace spočívá v rozpoznání uživatele, autorizací rozumíme rozhodování, zda má povolení k provádění toho, co se provést pokouší.)

source: (See _Chapter 9_ for more information about exactly what files are contained in the `.git` directory you just created.)
cs: (Více informací o tom, jaké soubory obsahuje právě vytvořený adresář `.git`, naleznete v _kapitole 9_.)

source: (This is set by your shell’s `$EDITOR` environment variable — usually vim or emacs, although you can configure it with whatever you want using the `git config --global core.editor` command as you saw in _Chapter 1_.
cs: (Ten je nastaven proměnnou prostředí `$EDITOR` vašeho shellu. Většinou se bude jednat o editor vim nebo emacs, ale pomocí příkazu `git config --global core.editor` můžete nastavit i jakýkoli jiný – viz _kapitola 1_.)

source: (We’ll go over what branches are and how to use them in much more detail in _Chapter 3_.)
cs: (Podrobněji se budeme větvím a jejich použití věnovat v _kapitole 3_.)

source: * Blank lines or lines starting with `#` are ignored.
cs: * Prázdné řádky nebo řádky začínající znakem `#` budou ignorovány.

source: * Speed * Simple design * Strong support for non-linear development (thousands of parallel branches) * Fully distributed * Able to handle large projects like the Linux kernel efficiently (speed and data size)
cs: * Rychlost, * jednoduchý návrh, * silná podpora nelineárního vývoje (tisíce paralelních větví), * plně distribuovaný, * schopnost efektivně spravovat velké projekty, jako je linuxové jádro (rychlost a objem dat).

source: * Standard glob patterns work.
cs: * Standardní masky souborů (glob patterns).

source: * You can end patterns with a forward slash (`/`) to specify a directory.
cs: * Chcete-li označit adresář, můžete masku zakončit lomítkem (`/`).

source: * You can negate a pattern by starting it with an exclamation point (`!`).
cs: * Pokud řádek začíná vykřičníkem (`!`), maska na něm je negována.

source: * `/etc/gitconfig` file: Contains values for every user on the system and all their repositories.
cs: * Soubor `/etc/gitconfig` obsahuje údaje pro všechny uživatele systému a pro všechny jejich repozitáře.

source: * `~/.gitconfig` file: Specific to your user.
cs: * Soubor `~/.gitconfig` je vázán na uživatelský účet.

source: * config file in the Git directory (that is, `.git/config`) of whatever repository you’re currently using: Specific to that single repository.
cs: * Konfigurační soubor v adresáři Git (tedy `.git/config`) jakéhokoliv užívaného repozitáře přísluší tomuto konkrétnímu repozitáři.

source: * Don’t set up and collaborate on a separate Git server.
cs: * Nevytvářejte oddělený server Git ani na žádný takový nepřispívejte.

source: * Keep a linear Git history that doesn’t contain merge commits made by `git merge`.
cs: * Udržujte lineární historii Git, která neobsahuje revize sloučením, vytvořené příkazem `git merge`.

source: *Access rights reporting*: Another convenient feature is what happens when you try and just ssh to the server.
cs: *Přehledy uživatelských oprávnění:* Další příjemnou vlastností je to, co se stane, pokud se pouze pokusíte připojit pomocí SSH na server.

source: *Delegation*: For really large installations, you can delegate responsibility for groups of repositories to various people and have them manage those pieces independently.
cs: *Delegace:* Pro opravdu velké instalace můžete delegovat zodpovědnost za skupiny a repozitáře dalším lidem a nechat je spravovat jednotlivé části nezávisle.

source: *Do not rebase commits that you have pushed to a public repository.*
cs: *Neprovádějte přeskládání u revizí, které jste odeslali do veřejného repozitáře.*
